import the libraries & load data

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = pd.read_csv("Online Sales Data.csv")

Basic data inspection

In [4]:
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240 entries, 0 to 239
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    240 non-null    int64
 1   Date              240 non-null    object
 2   Product Category  240 non-null    object
 3   Product Name      240 non-null    object
 4   Units Sold        240 non-null    int64
 5   Unit Price        240 non-null    float64
 6   Total Revenue     240 non-null    float64
 7   Region            240 non-null    object
 8   Payment Method    240 non-null    object
dtypes: float64(2), int64(2), object(5)
memory usage: 17.0+ KB

In [6]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [7]:
df.describe(include ='all')

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
count,240.00000,240,240,240,240.000000,240.000000,240.000000,240,240
unique,NaN,240,6,232,NaN,NaN,NaN,3,3
top,NaN,2024-01-01,Electronics,Dyson Supersonic Hair Dryer,NaN,NaN,NaN,North America,Credit Card
freq,NaN,1,40,2,NaN,NaN,NaN,80,120
mean,10120.50000,NaN,NaN,NaN,2.158333,236.395583,335.699375,NaN,NaN
std,69.42622,NaN,NaN,NaN,1.322454,429.446695,485.804469,NaN,NaN
min,10001.00000,NaN,NaN,NaN,1.000000,6.500000,6.500000,NaN,NaN
25%,10060.75000,NaN,NaN,NaN,1.000000,29.500000,62.965000,NaN,NaN
50%,10120.50000,NaN,NaN,NaN,2.000000,89.990000,179.970000,NaN,NaN
75%,10180.25000,NaN,NaN,NaN,3.000000,249.990000,399.225000,NaN,NaN
max,10240.00000,NaN,NaN,NaN,10.000000,3899.990000,3899.990000,NaN,NaN

Data cleaning

In [8]:
df.isnull()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
235,False,False,False,False,False,False,False,False,False
236,False,False,False,False,False,False,False,False,False
237,False,False,False,False,False,False,False,False,False
238,False,False,False,False,False,False,False,False,False
239,False,False,False,False,False,False,False,False,False

In [9]:
df.isnull().sum()

Transaction ID      0
Date                0
Product Category    0
Product Name        0
Units Sold          0
Unit Price          0
Total Revenue       0
Region              0
Payment Method      0
dtype: int64

In [10]:
df.columns

Index(['Transaction ID', 'Date', 'Product Category', 'Product Name',
       'Units Sold', 'Unit Price', 'Total Revenue', 'Region',
       'Payment Method'],
      dtype='object')

In [11]:
df.columns = df.columns .str.lower()

In [12]:
df.columns

Index(['transaction id', 'date', 'product category', 'product name',
       'units sold', 'unit price', 'total revenue', 'region',
       'payment method'],
      dtype='object')

In [13]:
df.columns = df.columns.str.replace(' ','_')

In [14]:
df.columns

Index(['transaction_id', 'date', 'product_category', 'product_name',
       'units_sold', 'unit_price', 'total_revenue', 'region',
       'payment_method'],
      dtype='object')

Exploratory Data Analysis(EDA)

In [15]:
##verify revenue
df['calculated_revenue']=df['units_sold']*df['unit_price']

In [16]:
##total revenue
df['total_revenue'].sum()

np.float64(80567.84999999999)

In [17]:
value =np.float64(80567.84999999999)

In [18]:
int(round(value))

80568

In [19]:
##Payment method analysis
df['payment_method'].value_counts()

payment_method
Credit Card    120
PayPal          80
Debit Card      40
Name: count, dtype: int64

In [20]:
##Revenue by region
df.groupby('region')['total_revenue'].sum()

region
Asia             22455.45
Europe           21268.06
North America    36844.34
Name: total_revenue, dtype: float64

In [21]:
##revenue by category
df.groupby('product_category')['total_revenue'].sum().sort_values(ascending=False)

product_category
Electronics        34982.41
Home Appliances    18646.16
Sports             14326.52
Clothing            8128.93
Beauty Products     2621.90
Books               1861.93
Name: total_revenue, dtype: float64

connection to sql server

In [22]:
!pip install pyodbc sqlalchemy pandas

Requirement already satisfied: pyodbc in c:\users\sushmitha\appdata\local\programs\python\python312\lib\site-packages (5.3.0)
Requirement already satisfied: sqlalchemy in c:\users\sushmitha\appdata\local\programs\python\python312\lib\site-packages (2.0.45)
Requirement already satisfied: pandas in c:\users\sushmitha\appdata\local\programs\python\python312\lib\site-packages (2.3.3)
Requirement already satisfied: greenlet>=1 in c:\users\sushmitha\appdata\local\programs\python\python312\lib\site-packages (from sqlalchemy) (3.3.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\sushmitha\appdata\local\programs\python\python312\lib\site-packages (from sqlalchemy) (4.15.0)
Requirement already satisfied: numpy>=1.26.0 in c:\users\sushmitha\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.4.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\sushmitha\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\sushmitha\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\sushmitha\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\sushmitha\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [31]:
from sqlalchemy import create_engine, types
import pandas as pd
import urllib

In [33]:
params = urllib.parse.quote_plus(
    "DRIVER={SQL Server};"
    "SERVER=SUSHMA\\SQLEXPRESS;"
    "DATABASE=online_sales;"
    "Trusted_Connection=yes;"
)

engine = create_engine(
    f"mssql+pyodbc:///?odbc_connect={params}",
    fast_executemany=True)

In [34]:
print(df.shape)
print(df.dtypes)

(240, 9)
Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [25]:
df = pd.read_csv("Online Sales Data.csv")

In [26]:
## checking column data type
df.dtypes

Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [37]:
dtype_mapping = {
    'column_str': types.VARCHAR(255), # Specify max length for string columns
    'column_float': types.Float(precision=24), # Or types.Numeric(precision=10, scale=5) if more control is needed
    'column_decimal': types.Numeric(precision=10, scale=3) # Example for a decimal column
    # 'column_int': types.INTEGER # Not usually necessary for standard integers
}


print("Defined dtype mapping:")
print(dtype_mapping)

Defined dtype mapping:
{'column_str': VARCHAR(length=255), 'column_float': Float(precision=24), 'column_decimal': Numeric(precision=10, scale=3)}

In [38]:
print("\nSimulating df.to_sql call with explicit dtypes...")

Simulating df.to_sql call with explicit dtypes...

In [27]:
from sqlalchemy import Integer, Float, String

dtype_map = {
    "units sold": Integer(),
    "unit price": Float(precision=2),
    "total revenue": Float(precision=2)
}

In [28]:
df = pd.DataFrame(df)
print(df)

     Transaction ID        Date Product Category  \
0             10001  2024-01-01      Electronics
1             10002  2024-01-02  Home Appliances
2             10003  2024-01-03         Clothing
3             10004  2024-01-04            Books
4             10005  2024-01-05  Beauty Products
..              ...         ...              ...
235           10236  2024-08-23  Home Appliances
236           10237  2024-08-24         Clothing
237           10238  2024-08-25            Books
238           10239  2024-08-26  Beauty Products
239           10240  2024-08-27           Sports

                                        Product Name  Units Sold  Unit Price  \
0                                      iPhone 14 Pro           2      999.99
1                                   Dyson V11 Vacuum           1      499.99
2                                   Levi's 501 Jeans           3       69.99
3                                  The Da Vinci Code           4       15.99
4                            Neutrogena Skincare Set           1       89.99
..                                               ...         ...         ...
235  Nespresso Vertuo Next Coffee and Espresso Maker           1      159.99
236                        Nike Air Force 1 Sneakers           3       90.00
237           The Handmaid's Tale by Margaret Atwood           3       10.99
238             Sunday Riley Luna Sleeping Night Oil           1       55.00
239                       Yeti Rambler 20 oz Tumbler           2       29.99

     Total Revenue         Region Payment Method
0          1999.98  North America    Credit Card
1           499.99         Europe         PayPal
2           209.97           Asia     Debit Card
3            63.96  North America    Credit Card
4            89.99         Europe         PayPal
..             ...            ...            ...
235         159.99         Europe         PayPal
236         270.00           Asia     Debit Card
237          32.97  North America    Credit Card
238          55.00         Europe         PayPal
239          59.98           Asia    Credit Card

[240 rows x 9 columns]